NNModel(
  (input): Linear(in_features=109, out_features=109, bias=True)
  (hid): Linear(in_features=109, out_features=109, bias=True)
  (output): Linear(in_features=109, out_features=1, bias=True)
  (dropout): Dropout(p=0.2, inplace=False)
)